## Merging
Merging = SQL-style joins between DataFrames on one or more keys.

In [1]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({
    'ID': [1, 2, 3], 
    'Name': ['Alice', 'Bob', 'Charlie']
})

df2 = pd.DataFrame({
    'ID': [2, 3, 4], 
    'Salary': [60000, 70000, 80000]
})

In [ ]:
# INNER JOIN (by default)

pd.merge(df1, df2, on='ID')

   ID     Name  Salary
0   2      Bob   60000
1   3  Charlie   70000

In [6]:
# LEFT JOIN

pd.merge(df1, df2, on='ID', how='left')

   ID     Name   Salary
0   1    Alice      NaN
1   2      Bob  60000.0
2   3  Charlie  70000.0

In [7]:
# RIGHT JOIN

pd.merge(df1, df2, on='ID', how='right')

   ID     Name  Salary
0   2      Bob   60000
1   3  Charlie   70000
2   4      NaN   80000

In [ ]:
# OUTER JOIN

pd.merge(df1, df2, on='ID', how='outer')

   ID     Name   Salary
0   1    Alice      NaN
1   2      Bob  60000.0
2   3  Charlie  70000.0
3   4      NaN  80000.0